## Pandas

### 1. Pandas DataFrame and Operations

In [1]:
# pandas 라이브러리를 불러옵니다. pd를 약칭으로 사용합니다.
# 1.x으로 써야 numpy로 호환되므로 1.5.3 추천
import pandas as pd
pd.__version__

'1.5.3'

- DataFrame은 2차원 테이블이고, 테이블의 한 줄(행/열)을 Series라고 합니다.


- Series의 모임이 곧, DataFrame이 됩니다.

In [2]:
# 12x4 행렬에 1부터 36까지의 숫자를 원소를 가지고, index는 0부터 시작하고, coulmns은 순서대로 X1, X2, X3, X4로 하는 DataFrame 생성
import numpy as np
np.random.seed(42)
df = pd.DataFrame(data=np.random.randn(12, 4),
                  index=np.arange(0, 12),
                  columns=['X1', 'X2', 'X3', 'X4'])
df

          X1        X2        X3        X4
0   0.496714 -0.138264  0.647689  1.523030
1  -0.234153 -0.234137  1.579213  0.767435
2  -0.469474  0.542560 -0.463418 -0.465730
3   0.241962 -1.913280 -1.724918 -0.562288
4  -1.012831  0.314247 -0.908024 -1.412304
5   1.465649 -0.225776  0.067528 -1.424748
6  -0.544383  0.110923 -1.150994  0.375698
7  -0.600639 -0.291694 -0.601707  1.852278
8  -0.013497 -1.057711  0.822545 -1.220844
9   0.208864 -1.959670 -1.328186  0.196861
10  0.738467  0.171368 -0.115648 -0.301104
11 -1.478522 -0.719844 -0.460639  1.057122

In [3]:
# dataframe index
df.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [4]:
# dataframe columns
df.columns

Index(['X1', 'X2', 'X3', 'X4'], dtype='object')

In [5]:
# dataframe values
df.values

array([[ 0.49671415, -0.1382643 ,  0.64768854,  1.52302986],
       [-0.23415337, -0.23413696,  1.57921282,  0.76743473],
       [-0.46947439,  0.54256004, -0.46341769, -0.46572975],
       [ 0.24196227, -1.91328024, -1.72491783, -0.56228753],
       [-1.01283112,  0.31424733, -0.90802408, -1.4123037 ],
       [ 1.46564877, -0.2257763 ,  0.0675282 , -1.42474819],
       [-0.54438272,  0.11092259, -1.15099358,  0.37569802],
       [-0.60063869, -0.29169375, -0.60170661,  1.85227818],
       [-0.01349722, -1.05771093,  0.82254491, -1.22084365],
       [ 0.2088636 , -1.95967012, -1.32818605,  0.19686124],
       [ 0.73846658,  0.17136828, -0.11564828, -0.3011037 ],
       [-1.47852199, -0.71984421, -0.46063877,  1.05712223]])

In [6]:
# 특정 column을 가져오기
df['X1']

0     0.496714
1    -0.234153
2    -0.469474
3     0.241962
4    -1.012831
5     1.465649
6    -0.544383
7    -0.600639
8    -0.013497
9     0.208864
10    0.738467
11   -1.478522
Name: X1, dtype: float64

In [7]:
# X1 column에 2 더하기
df['X1'] + 2

0     2.496714
1     1.765847
2     1.530526
3     2.241962
4     0.987169
5     3.465649
6     1.455617
7     1.399361
8     1.986503
9     2.208864
10    2.738467
11    0.521478
Name: X1, dtype: float64

### 2.2. Dataframe 기초 method

In [8]:
# dataframe의 맨 위 다섯줄을 보여주는 head()
df.head()

         X1        X2        X3        X4
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137  1.579213  0.767435
2 -0.469474  0.542560 -0.463418 -0.465730
3  0.241962 -1.913280 -1.724918 -0.562288
4 -1.012831  0.314247 -0.908024 -1.412304

In [9]:
# 10줄
df.head(10)

         X1        X2        X3        X4
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137  1.579213  0.767435
2 -0.469474  0.542560 -0.463418 -0.465730
3  0.241962 -1.913280 -1.724918 -0.562288
4 -1.012831  0.314247 -0.908024 -1.412304
5  1.465649 -0.225776  0.067528 -1.424748
6 -0.544383  0.110923 -1.150994  0.375698
7 -0.600639 -0.291694 -0.601707  1.852278
8 -0.013497 -1.057711  0.822545 -1.220844
9  0.208864 -1.959670 -1.328186  0.196861

In [10]:
# dataframe에 대한 전체적인 요약정보를 보여줍니다. index, columns, null/not-null/dtype/memory usage가 표시됩니다.
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      12 non-null     float64
 1   X2      12 non-null     float64
 2   X3      12 non-null     float64
 3   X4      12 non-null     float64
dtypes: float64(4)
memory usage: 480.0 bytes

In [11]:
# dataframe에 대한 전체적인 통계정보를 보여줍니다.
df.describe()

              X1         X2         X3         X4
count  12.000000  12.000000  12.000000  12.000000
mean   -0.100154  -0.450107  -0.303047   0.032117
std     0.801497   0.817508   0.962175   1.118572
min    -1.478522  -1.959670  -1.724918  -1.424748
25%    -0.558447  -0.804311  -0.968766  -0.726927
50%    -0.123825  -0.229957  -0.462028  -0.052121
75%     0.305650   0.126034   0.212568   0.839857
max     1.465649   0.542560   1.579213   1.852278

In [12]:
# X2 column를 기준으로 내림차순 정렬
df.sort_values(by='X2')

          X1        X2        X3        X4
9   0.208864 -1.959670 -1.328186  0.196861
3   0.241962 -1.913280 -1.724918 -0.562288
8  -0.013497 -1.057711  0.822545 -1.220844
11 -1.478522 -0.719844 -0.460639  1.057122
7  -0.600639 -0.291694 -0.601707  1.852278
1  -0.234153 -0.234137  1.579213  0.767435
5   1.465649 -0.225776  0.067528 -1.424748
0   0.496714 -0.138264  0.647689  1.523030
6  -0.544383  0.110923 -1.150994  0.375698
10  0.738467  0.171368 -0.115648 -0.301104
4  -1.012831  0.314247 -0.908024 -1.412304
2  -0.469474  0.542560 -0.463418 -0.465730

### 2.3. Fancy Indexing !

- 데이터를 filtering <=> Search !

- 전체 데이터에서 원하는 일부의 데이터를 찾아오는 방법 !

In [13]:
# pandas dataframe은 column 이름을 이용하여 기본적인 Indexing이 가능합니다.
# X1 column을 indexing
df['X1']

0     0.496714
1    -0.234153
2    -0.469474
3     0.241962
4    -1.012831
5     1.465649
6    -0.544383
7    -0.600639
8    -0.013497
9     0.208864
10    0.738467
11   -1.478522
Name: X1, dtype: float64

In [14]:
# dataframe에서 slicing을 이용하면 row 단위로 잘려나옵니다.
# 앞에서 3줄을 slicing 합니다.
df[:3]

         X1        X2        X3        X4
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137  1.579213  0.767435
2 -0.469474  0.542560 -0.463418 -0.465730

In [15]:
# df에서 index value를 기준으로 indexing도 가능합니다. (여전히 row 단위)
df.loc[0]

X1    0.496714
X2   -0.138264
X3    0.647689
X4    1.523030
Name: 0, dtype: float64

In [16]:
# df.loc는 특정값을 기준으로 indexing합니다. (key - value)
# df.loc[index, colum]

df.loc[0, 'X1']

0.4967141530112327

In [17]:
# df.loc에 2차원 indexing도 가능합니다.
df.loc[[0, 3], ['X1', 'X4']]

         X1        X4
0  0.496714  1.523030
3  0.241962 -0.562288

In [18]:
# dataframe에 조건식을 적용해주면 조건에 만족하는지 여부를 알려주는 "mask"가 생깁니다.
# Q. df에서 X3 column에 있는 원소들중에 3의 배수만 출력해주세요!
mask = df['X3'] > 0 # boolean mask
print(df[mask])
print(df[mask]['X3'])
## df.loc[row에 대한 조건식, col에 대한 조건식]
print(df.loc[mask, 'X3'])

         X1        X2        X3        X4
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137  1.579213  0.767435
5  1.465649 -0.225776  0.067528 -1.424748
8 -0.013497 -1.057711  0.822545 -1.220844
0    0.647689
1    1.579213
5    0.067528
8    0.822545
Name: X3, dtype: float64
0    0.647689
1    1.579213
5    0.067528
8    0.822545
Name: X3, dtype: float64

In [19]:
# 2차원 리스트 indexing과 같은 원리가 되었습니다.
# integer-location based indexing
df.iloc[1, 1]

-0.23413695694918055

In [20]:
# iloc로 2차원 indexing을 하게되면, row 기준으로 index 3,4를 가져오고 column 기준으로 0, 1을 가져옵니다.
df.iloc[[3, 4], [0, 1]]

         X1        X2
3  0.241962 -1.913280
4 -1.012831  0.314247

In [21]:
# Q. 2차원 indexing에 뒤에가 : 면 어떤 의미일까요?
print(df.iloc[:, 3], '\n') # X4 column
print(df.iloc[0, :]) # row 0

0     1.523030
1     0.767435
2    -0.465730
3    -0.562288
4    -1.412304
5    -1.424748
6     0.375698
7     1.852278
8    -1.220844
9     0.196861
10   -0.301104
11    1.057122
Name: X4, dtype: float64

X1    0.496714
X2   -0.138264
X3    0.647689
X4    1.523030
Name: 0, dtype: float64

## 2.3. 여러 DataFrame 합치기

In [22]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']})

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']})

In [23]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [24]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [25]:
df3

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [26]:
# 위-아래로 합치기 (concat)
pd.concat([df1, df2, df3]).reset_index(drop='Index')

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [27]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A1', 'A2'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']})

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C6', 'C7', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']})

In [28]:
# SQL과 같이 join operation을 사용할 수 있다.
# A join B --> table A와 table B의 특정 column에서 겹치는 값들을 기준으로 두 테이블을 합치는 연산
pd.merge(left=df1,
         right=df2,
         on='A',
         how='inner')

    A B_x C_x D_x B_y C_y D_y
0  A1  B1  C1  D1  B6  C6  D6
1  A2  B2  C2  D2  B7  C7  D7

In [29]:
# left join
pd.merge(df1, df2, on='A', how='left')

    A B_x C_x D_x  B_y  C_y  D_y
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1   B6   C6   D6
2  A2  B2  C2  D2   B7   C7   D7
3  A3  B3  C3  D3  NaN  NaN  NaN

## 2.4 DataFrame으로 데이터 불러오기


Source : https://www.kaggle.com/c/titanic/data

In [30]:
# train.csv 파일 불러오기
titanic = pd.read_csv("./data/train.csv")
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [31]:
# Q1. 여성 승객들의 평균 나이를 계산해보세요.
titanic.loc[titanic.Sex == 'female']['Age'].mean()

27.915708812260537

In [32]:
# Q2. 1등석에 탑승한 승객 중 최대 요금을 낸 사람의 이름
temp = titanic.loc[titanic.Pclass == 1][['Name', 'Fare']]
temp.loc[temp.Fare == temp.Fare.max()]['Name']

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

In [33]:
# Q3. 1등석에 탑승한 승객 중 승선한 곳이 Queenstown인 사람들의 수는?
len(titanic.loc[(titanic.Pclass == 1) & (titanic.Embarked == 'Q')])

2

In [34]:
# Q4. 승선한 곳이 "S"인 사람들 중 생존자 수는?
titanic.loc[titanic.Embarked == 'S']['Survived'].sum()

217

In [35]:
# Q5. 미혼 여성 중에 나이를 알 수 없는 사람의 수는?
titanic.loc[titanic.Name.str.contains('Miss.'), 'Age'].isna().sum()

36

## 2.5. Pivot Table을 이용하여 데이터 살펴보기

- pivot table이란 기존 테이블 구조를 특정 column을 기준으로 재구조화한 테이블을 말합니다.

- 특정 column을 기준으로 pivot하기 때문에, 어떤 column에 어떤 연산을 하느냐에 따라서 만들어지는 결과가 바뀝니다.

- 주로 어떤 column을 기준으로 데이터를 해석하고 싶을 때 사용합니다.

In [39]:
# 성별을 기준으로 생존률 파악 --> Mean vs Sum
pd.pivot_table(data=titanic, index='Sex', values='Survived', aggfunc=['mean', 'sum'])

            mean      sum
        Survived Survived
Sex
female  0.742038      233
male    0.188908      109

In [45]:
# 사회 계급을 기준으로 생존률 파악
pd.pivot_table(data=titanic, index='Pclass', values='Survived', aggfunc='mean')

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363